{"raw_text": " 1 HANOI UNIVERSITY Faculty of Information Technology    62FIT2DSA Data Structure and Algorithm Spring 2024 Module Description  Contact Details Instructor:    Dr. Nguyen Xuan Thang Office:    Room 212, Building C, Hanoi University Email:     nxthang@hanu.edu.vn   Module Overview  1. Module Details Faculty    Information Technology Module code    62FIT2DSA Module name  Data Structure and Algorithm Level     Undergraduate Number of credits   Three (3) Prerequisite    Programming 1 Suggested study   Five (05) hours per week Year    2024  2. Nature of the module It is a compulsory module for the second year students in the Excellent Educational Bachelor of IT Program (CLC Program). The goal of this module is to introduce the essential concepts and issues in Data structures and algorithms. Topics include algorithm analysis, searching/sorting algorithms and fundamental data structures such as stack, queue, tree and graph. The module aims to gear these ideas towards specific significant applications using Java programming language. 3. Learning objectives On the completion of this module students should be able to: 3.1. understand fundamental knowledge of algorithm design and analysis. 3.2. gain general knowledge about some types of data structures and their operations. 3.3. implement some basic algorithms such as sorting, searching or graph algorithms using Java programming language. 3.4. have teamwork, self-study and programming skills using Java. \n 2 3.5. develop self-motivation and time management skills.  Learning Resources Name Notes Use 1. Mark Allen Weiss, (2012), Data structures and algorithm analysis in Java, 3rd Edition, Pearson. Textbook Lecture 2. Thomas H, Cormen, et all (2009), Introduction to Algorithms, 3rd Edition, MIT Press Supplementary material  REF  Course website:   https://lms.fit.hanu.vn/course/view.php?id=10 Assessments 1. Assessment table is applied to all students Type Assessment Name Weight Brief Description Linked learning objectives Internal Attendance 10% Students are expected to attend all classes. Students must participate in at least 80% of classes. Students who are requesting an excused absence are expected to show certified evidences.  Discussion 20% Tasks will be assigned to students during class. Students have to present their answers or solutions.  3.3, 3.4, 3.5 Midterm 20% Paper-based exam  3.1, 3.2, 3.3 Final  50% Paper-based exam  3.1, 3.2, 3.3, 3.5  2. Determination of final grade Your internal marks and final mark are rounded to integers out of 10. Your course mark is rounded to one decimal place. The calculation for the course mark uses the weightings in the assessment table above. You are not qualified to take the final exam if you participate less than 80% of classes. Your grade is determined from your course mark according to Hanoi University scale:  3   Course mark Grade Pass the module  9.0 – 10 A+  8.5 – 8.9 A  8.0 – 8.4 B+  7.0 – 7.9 B  6.0 – 6.9 C+  5.5 – 5.9 C  5.0 – 5.4 D+ Fail the module  4.0 – 4.9 D  < 4.0 F   Teaching schedule  Week Lecture Tutorial Reading 1 Introduction  Java review [1] Chapter 1 [2] Subtopics 1.1 & 1.2 2 Analysis of algorithms Part I Algorithm implementation Part I [1] Chapter 2 [2] Subtopics 1.3 & 1.4 3 Analysis of algorithms Part II Algorithm implementation Part II [1] Chapter 2 [2] Subtopics 1.3 & 1.4 4 Sorting Part I Implement algorithms: selection sort, insertion sort, buble sort, merge sort [1] Chapter 7 [2] Subtopics 2.6 - 2.8 5 Sorting Part II Implement algorithms: quick sort, couting sort, radix sort [1] Chapter 7 [2] Subtopics 2.6 - 2.8 6 List Implement list operations [1] Chapter 3: 3.1 – 3.5 [2] Subtopic 3.10 7 Stack and Queue Implement stack and queue operations [1] Chapter 3: 3.6 & 3.7 [2] Subtopic 3.10 8 Midterm No tutorial  9 Stack and Queue application Implement stack and queue application [1] Chapter 3: 3.6 & 3.7 [2] Subtopic 3.10 10 Tree Part I Implement tree operations Part I [1] Chapter 4 [2] Subtopic 3.12 11 Tree Part II Implement tree operations Part II [1] Chapter 4 [2] Subtopic 3.12 12 Graph Part I Implement graph operations Part I [1] Chapter 9 [2] Subtopics 6.22 & 6.23 13 Graph Part II Implement graph operations Part II [1] Chapter 9 [2] Subtopics 6.22 & 6.23 14 Algorithm design techniques Self-study [1] Chapter 10 [2] Subtopics 4.15 & 4.16 15 Revision Q&A   4  Academic Honesty and Misconduct Hanoi University expects all students and staff to act with honesty and integrity with all matters. IDESOA12  – In Radix sort algorithm …?  \n A stable sorting algorithm is used to sort the digits.  \n  \n IDELI03  – In the ADT of the list data structure, isEmpty() method returns a/an _______ value?  \n Boolean.  \n  \n IDHTRE03 – The pre -order traversal sequence of a binary search tree is: 30, 20, 10, 15, 25, 23, 39, 35, \n42. Which one of the following is the post -order traversal sequence of the same tree?  \n 15, 10, 23, 25, 20, 35, 42, 39, 30  \n  \n The following method reverses the item's order of a stack using a queue. Ple ase complete the code of \nthe method?  \n    public static int reverse(SLLStack s)  \n    { \n           ArrayQueue q = new ArrayQueue();  \n           while (!s.isEmpty())  \n           { \n               StackNode node = Tr ả lời s.pop()  \n ;                    \n               q.enqueue(node.getData());  \n           } \n           while (Tr ả lời !q.isEmpty()  \n ) \n           { \n               StackNode newnode = new StackNode(q.dequeue());  \n               s.push(Tr ả lời newNode  \n ); \n           } \n    }   \nIDETRE07 – What can you say abou t the following tree?  \nThis is a binary search tree.  \n \nIDHSOA07  – Consider an array A where the items are in the range from 1 to n^3. Which of the following \nsorting algorithms gives the best time efficiency when applied on A?  \nRadix sort  \n \nIDMSOA08  – Which array represents a Min -Heap?  \nA={2,5,9,8,10,13,12,22,50}  \n \nIDHTRE10  – Suppose that we perform pre -order traversal of a binary tree T to get the sequence label \n“ABCDEXZUTY”. Then we perform in -order traversal of the same binary tree to get the sequen ce label \n“DCEBAUZTXY” as the result. What is the result if we perform post -order traversal of this tree?  \nDECBUTZYXA  \n \nIDMSQ10  – Suppose that you are implementing an operation named multiDequeue(int k) on a queue \ncontains integer items. This operation will p erform dequeue() k times and return the result of the kth \ndequeue(). Please complete the code of the operation?  \nm=m -1 \n \nIDMAOA15  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nO(N^2)  \n \nIDMSQAS01  – Which is the postfix notation of the following infix expression: ((8+2)*(5+7) -10)*9+3?  \n8 2 + 5 7 + * 10 - 9 * 3 +  \n \nIDMLI05  – In an Array -based list, what does this code do to the list?  \nInsert an item to the list  \n IDETRE20  – Compelete the following code of th e method inOrderTraversal() in the array -based binary \ntree implementation?  \nSystem.out.print(l[node]+“ ”)  \n \nIDEGRA08  – Which of the following is wrong about graph?  \nWeigh of an edge must be possitive.  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \n(node -1)/2 \n \nIDEGRA02  – The data structure required for Breadth First Traversal on a graph is?  \nQueue.  \n \nIDESQ07  – In ADT of the Queue data structure, enqueue() method will?  \nAdd a new item to the que ue at the rear position.  \n \nIDESQAS09  – Which of the following is not an application of the stack data structure?  \nMessage buffering.  \n \nIDMSQAS03  – Evaluate the following expression:8 7 + 6 4 + * 2 3 7 + * - 1 -? \n129 \n \nIDHAOA07  – The method f3(N) calls two meth ods f1(N) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nO(N^3)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nParallel edges.  IDMSQAS08 – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted i nto an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresultant hash table?  \nB \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nParallel edges.  \n \nIDESQ06  – In the ADT of the Queue data structure, dequeue() method will?  \nSelect one:  \nRemove an item from the queue at the front position.  \n \nIDETRE14  – In the ADT of array -based tree, P[K] indicates?  \nSelect one:  \nThe parent node of node K.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  \nSelect one:  \nX(data, prev, next)  \n \nIDESOA16 – Which of the following sorting algorithm does not have a worst case time complexity of \nO(n^2)?  \nMerge sort.  \n \nIDMGRA03  - In an unweighted, undirected  connected graph, the shortest path from a node S to every \nother node is computed most efficiently, in terms of time complexity by?  \nSelect one:  \nPerforming a BFS starting from S.  \n IDETRE17  – Which of the following is correct about array -based binary impleme ntation using perfect \nbinary tree indexing scheme?  \nSelect one:  \nThe left child and right child of node i are 2i+1 and 2i+2.  \n \nIDEGRA03  –   \nSelect one:  \nThe weight of the shortest path from vertex Vi to vertex Vj using intermediate verties in the set {V1..Vk}.  \n \nThe following method reverses the item's order of a stack using a queue. Please complete the code of \nthe method?  \n    public static int reverse(SLLStack s)  \n    { \n           ArrayQueue q = new ArrayQueue();  \n           while (!s.isEmpty())  \n           { \n               StackNode node = Tr ả lời s.pop()  \n ;                    \n               q.enqueue(node.getData());  \n           } \n           while (Tr ả lời !q.isEmpty()  \n ) \n           { \n               StackNode newnode = new StackNode(q.dequeue());  \n               s.push(Tr ả lời newnode  \n ); \n           } \n    } \n IDEGRA02  – The data structure required for Breadth First Traversal on a graph is?  \nSelect one:  \nQueue.  \n \nIDESQAS12  – In a hash table of the size N using linear probing, what is the probing hash function hi(k)?  \nSelect one:  \nhi(k)=(h(k)+i) mod N.  \n \nIDHTRE05  – A complete N -ary tree is a tree which each node has N children or no children. Let I be the \nnumber of interior nodes and L be the number of leaves in a complete N -aray  tree. If L=41 and I=10, \nwhat is the value of N?  \nSelect one:  \n5 \n \n \nIDESQ01  - Which statement below is wrong concerning to stack data structure?  \nSelect one:  \nIt is a First In First Out (FIFO) list.  \n \nIDMSQAS09  – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using open hashing with hash function: h(k)=k mod 10 and separate chaining. What is the \nresultant hash table?   \nSelect one:  \nA \n \nIDMAOA06  – Estimate the t ime complexity in Big -Oh notation, with respect to the input size N, for the \ncode below:   \nSelect one:  \nO(N^3)  \n IDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweighted directed graph with vertex P as the sou rce. In what order do the nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?   \nSelect one:  \nP, Q, R, U, S, T  \n \nIDHSOA04  – Which of the following sorting algorithms has the minimum number of swap o perations in \ngeneral?  \nSelect one:  \nInsertion sort  \n \nIDMSQAS03  – Evaluate the following expression:8 7 + 6 4 + * 2 3 7 + * - 1 -? \nSelect one:  \n129 \n \nIDHSQ05  – In the method F below, q is a queue containing integer items. What is the content of q after \ncalling F (), suppose that the rear of the queue is the right most item?   \nSelect one:  \n9 3 2 4 5  \n \nIDMSQ11  – Suppose that you are implementing an operation name multiPop(int k) on a stack contains \ninteger items. This operation will perform pop() k times and return th e result of the kth pop(). Please \ncomplete the code of the operation?   \nSelect one:  \nm=m -1 \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  Select one:  \nX(data, prev, next)  \n \nIDETRE03  – A binary tree that all its levels except possibly the last, is completely filled and all the node at \nthe last level appear as far left as possible,  is known as?  \nSelect one:  \nComplete binary tree.  \n \nIDHTRE07  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);   \nSelect one:  \nE \n \nIDESOA10  – In Merge sort algorithm …?  \nThe input array is d ivided into two parts at the middle of the array.  \n \nIDMSQAS08 – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresult ant hash table?   \nSelect one:  \nB \n \nIDEGRA06  – If we use adjacency matrix for representing an unweighted graph, we will have?  \nSelect one:  \nA matrix contains only 0 and 1  \n \nIDHAOA05 – What is the time complexity of the recursive method f(i) below?   \nSelect one:  \nO(N)  \n IDESQAS04  – What additional requirement is placed on an array, so that binary search may be used to \nsearch for a key?  \nSelect one:  \nThe array must be sorted.  \n \nIDHTRE09  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);   \nSelect one:  \nU \n \nIDMAOA09  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below   \nSelect one:  \nO(N^2)  \n \nIDETRE21  – Complete the following code of the method postOrderTrav ersal() in the array -based binary \ntree implementation?   \nSelect one:  \npostOrderTraversal(getRightChild(node))  \n \nIDEGRA09  – To implement Dijkstra’s shortest path algorithm on unweighted graphs the data structure \nto be used is?  \nSelect one:  \nQueue  \n \nIDHTRE10  – Suppose that we perform pre -order traversal of a binary tree T to get the sequence label \n“ABCDEXZUTY”. Then we perform in -order traversal of the same binary tree to get the sequence label \n“DCEBAUZTXY” as the result. What is the result if we perform post -orde r traversal of this tree?  \nSelect one:  \nDECBUTZYXA  \n IDMSQAS05  – Method F below takes a number n as an argument, and use a stack s to do processing. \nWhat does the method do in general?   \nSelect one:  \nPrint binary representation of n.  \n \nIDHSOA05  – Consider a modified version of Merge sort where the input array is partitioned at the \nposition one -third of the length N of the array. What is the recurrence of this algorithm?  \nSelect one:  \nT(N)=T(N/3)+T(2N/3)+O(N)  \n \nIDETRE05  –How many nodes in a tree has  no ancestors?  \nSelect one:  \n1 \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDETRE03  – A binary tree that all its levels except possibly the last, is completely filled and all the node at \nthe last level appear as far left as possible, is known as?  \nSelect one:  \nComplete binary tree.  \n \nIDMSQ12  – A queue q has 5 items. How many items left in q after executing: q.enqueue(q.dequeue())?  \nSelect one:  \n5 \n \nIDESOA16  – Which of the following sorting al gorithm does not have a worst case time complexity of \nO(n^2)?  \nSelect one:  Merge sort.  \n \nIDEGRA01  – In an undirected graph with N vertices and E edges, the sum of the degree of each vertex is \nequal to?  \nSelect one:  \n2E. \n \nIDHAOA08  – The method f3(N) calls two methods f1(N) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nSelect one:  \nO(N^4)  \n \nIDMLI09 - Consider method F in Java and a singly linked list L below. Suppose that H is the head node of \nthe list L. What is  the result if we call F(H)?  \nSelect one:  \n‘E’-->‘C’-->‘A’ \n \nIDMSQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function: \nh(k)=(3k+4) mod 7. Assuming the hash table is initially empty, which of the following is the contents  of \nthe table when the sequence 1, 3, 8, 10 is inserted into the table using close hasing with linear probing? \nNote that ‘ -’ denotes an empty location in the table.  \nSelect one:  \n1, 8, 10, -, -, -, 3 \n \nIDHTRE04 – The pre -order traversal sequence of a binary s earch tree is:70, 40, 20, 30, 60, 50, 90, 80, \n100. What is the depth of the binary search tree?  \nSelect one:  \n3 \n \nIDHSQ04 – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?  \nSelect one:  1 2 3 4 5 6 7 8 9 10  \n \nIDHLI04  – Method deleteTail() below is used to delete the last node in a Singly Linked List. Please \ncomplete the code of the method?  \nSelect one:  \nbeforeTail.setNext(null)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot cont ain information of?  \nSelect one:  \nParallel edges.  \n \nIDHTRE02  – The pre -order and post -order traversal of a binary tree generates the same output. The tree \ncan have maximum?  \nSelect one:  \nOne node.  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method  is used to?  \nSelect one:  \nadd an item to the stack.  \n \nIDEGRA04 – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDETRE16  – Complete the following code of the method getNodeLabel() in the array -based tree \nimplementation?   \nSelect one:  \nl[node]  \n IDHTRE06  – Consider the recursive, nested representation of binary trees: T=(O L R) indicates a binary \ntree T with the root node O, the left sub -tree L and the right sub -tree R. Note that L and R may be null or \nfurther nested. Which of the following represents a valid binary tree?  \nSelect one:  \n(1 (2 3 4) (5 6 7))  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDETRE 01 – A perfect binary tree with 2N+1 nodes contain?  \nSelect one:  \nN interior nodes.  \n \nIDHSOA03  – Given an array A that is almost sorted (only one or two elements are misplaced). Which \nsorting algorithm gives the best time efficiency when applied on A.  \nSelect one:  \nInsertion sort  \n \nIDMSQAS02  – Which is the prefix notation of the following infix expression:5 + (7 + 9*3)*(2+8)?  \nSelect one:  \n+ 5 * + 7 * 9 3+ 2 8  \n \nIDESQ10 – Complete the code for the dequeue() method in array -based circular queue?   \nSelect one:  \nfront=( front+1)%maxSize  \n \nIDESOA15  – What is an operation in which a list of elements is arranged either in ascending order or in \ndescending order?  \nSelect one:  Sorting.  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect  one:  \nParallel edges.  \n \nIDMLI04 – In a Singly Linked List implementation, what does this code to to the list?   \nSelect one:  \nRemove the node at the pos position from the list  \n \nIDESQAS05  – What is the best definition of a collision in a hash table?  \nSelect one : \nTwo entries with different keys have the same exact hash value.  \n \nIDEGRA05 – If we use adjacency matrix for representing a weighted undirected graph, we will have?  \nSelect one:  \nA symmetric matrix over its diagonal  \n \nIDHSQ04 – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?   \nSelect one:  \n1 2 3 4 5 6 7 8 9 10  \n \nIDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweigh ted directed graph with vertex P as the source. In what order do the nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?   \nSelect one:  \nP, Q, R, U, S, T  \n \nIDHTRE01  – One can convert a binary tree i nto its mirror image by traversing it in?  Post -order.  \n \nIDHLI04  – Method deleteTail() below is used to delete the last node in a Singly Linked List. Please \ncomplete the code of the method?   \nSelect one:  \nbeforeTail.setNext(null)  \n \nIDHSQ01  – Suppose that you a re writing a program to evaluate if a given string input has proper closing \nparenthesis for every opening parenthesis. Which data structure should be used?  \nStack.  \n \nIDMSQAS10  – Consider a hash table of size seven, with starting index zero, and a hash functi on: \nh(k)=(3k+4) mod 7. Assuming the hash table is initially empty, which of the following is the contents of \nthe table when the sequence 1, 3, 8, 10 is inserted into the table using close hasing with linear probing? \nNote that ‘ -’ denotes an empty location in the table.  \nSelect one:  \n1, 8, 10, -, -, -, 3 \n \nIDESQAS04  – What additional requirement is placed on an array, so that binary search may be used to \nsearch for a key?  \nThe array must be sorted.  \n \nIDETRE08  – What can you say about the following tree?   \nSelect one:  \nThis is an expression tree.  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nOrder of the elements of the list.  \n \nIDHSOA03  – Given an array A that is almost sorted (only one or two elements are misplac ed). Which \nsorting algorithm gives the best time efficiency when applied on A.  Select one:  \nInsertion sort  \n \nIDMSQ09  – In an array -based circular queue, which operation has time complexity O(N) in the worst -\ncase?  \nSelect one:  \nNo operation that has time comple xity O(N).  \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHTRE06  – Consider the recursive, nested representation of binary trees: T=(O L R) indicates a binary \ntree T with the root nod e O, the left sub -tree L and the right sub -tree R. Note that L and R may be null or \nfurther nested. Which of the following represents a valid binary tree?  \nSelect one:  \n(1 (2 3 4) (5 6 7))  \n \nIDMSOA12  – The Merge method in Merge sort algorithm is used to combi ne two sorted array \nA={3,27,38,43} and B={9,10,82}. What is the result array C?  \nSelect one:  \nC={3,9,10,27,38,43,82}  \n \nIDEGRA01  – In an undirected graph with N vertices and E edges, the sum of the degree of each vertex is \nequal to?  \nSelect one:  \n2E. \n \nIDETRE09  – Which of the following is wrong about a binary search tree?  \nSelect one:  The value of the left sub -tree is bigger than the value of the root.  \n \nIDMAOA13 – Consider three algorithms which have the time complexity in Big -Oh notation below. \nPlease arrange th ese algorithms in the ascending order of time efficiency (the slowest algorithm is the \nfirst one in the order).   \nSelect one:  \nAlgorithm 3, Algorithm 1, Algorithm 2  \n \nIDHAOA09  – What is O(T(N)), if   \nSelect one:  \nO(2^N)  \n \nIDMLI12  – What is the number of compar isons needed in the worst case to search for a given node in a \nSingly Linked List of the length N nodes?  \nSelect one:  \nN \n \nIDESOA04  – In a stable sort algorithm …?  \nSelect one:  \nThe relative order of elements with equal keys are maintained.  \n \nIDMGRA02  – An adjac ency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method is used to?  \nSelect one:  \nadd an item to the stack.  \n \nIDESQ04  – Which statement is correct about array -based stack?  Select one:  \ntop is the last item of the array.  \n \nIDMSQAS05 – Method F below takes a number n as an argument, and use a stack s to do processing. \nWhat does the method do in general?  \nSelect one:  \nPrint bi nary representation of n.  \n \nIDEGRA02 – The data structure required for Breadth First Traversal on a graph is?  \nSelect one:  \nQueue.  \n \nIDMAOA10  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nSelect one:  \nO(N^3)  \n \nIDMSQ11  – Suppose that you are implementing an operation name multiPop(int k) on a stack contains \ninteger items. This operation will perform pop() k times and return the result of the kth pop(). Please \ncomplete the code of the operation?  \nSelect one:  \nm=m -1 \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDETRE08  – What can you say about the following tree?  \nSelect one:  \nThis is an expression tree.   \nIDHLI02  – Method reverse() below is used to reverse the order of items in a Singly Linked List. Please \ncomplete the code of the method?  \nSelect one:  \nhead=prev  \n \nIDELI13 – In a Circular Linked List, if a Node X(data,next) is a tail which is the value of the X’s next?  \nSelect one:  \nhead  \n \nIDHSQ04  – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?  \nSelect one:  \n1 2 3 4 5 6 7 8 9 10  \n \nIDMSOA02  – Insertion sort algorithm is used to sort the array A={23 ,78,45,8,32,56} in the ascending \norder. What are the items of A after 03 sort pass?  \nSelect one:  \nA={8,23,45,78,32,56}  \n \nIDESQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function \nh(k)=(3k+4) mod 7. What is the address of t he key k=10?  \nSelect one:  \n6. \n \nIDESOA12  – In Radix sort algorithm …?  \nSelect one:  \nA stable sorting algorithm is used to sort the digits.  \n IDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \nSelect o ne: \n(node -1)/2 \n \nIDHSOA02  – Insertion sort is used to sort an array in the descending order. When does the best case \noccur?  \nSelect one:  \nThe array is already sorted in the descending order.  \n \nIDMLI04  – In a Singly Linked List implementation, what does this code to to the list?  \nSelect one:  \nRemove the node at the pos position from the list  \n \nIDELI06 – In the ADT of the list data structure, remove(int post) method will?  \nRemove an item at the pos position  form the list.  \n \nIDHLI05  – Method tailToFront() below moves the last node of a Singly Linked List into the front of the \nlist. Please complete the code of the method?  \nbeforeTail.setNext(null); tail.setNext(head); head=tail;  \n \nIDEGRA04  – An adjacency matrix r epresentation of a graph cannot contain information of?  \nParallel edges.  \n \nIDEGRA09 – To implement Dijkstra’s shortest path algorithm on unweighted graphs the data structure \nto be used is?  \nQueue  \n \nIDHTRE02  – The pre -order and post -order traversal of a binary tree generates the same output. The tree \ncan have maximum?  One node.  \n \nIDMAOA09  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nO(N^2)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot c ontain information of?  \nParallel edges.  \n \nIDESQAS11  – Complete the code below to search for key in an array using linear seach algorithm?  \ni. \n \nIDESQ01 - Which statement below is wrong concerning to stack data structure?  \nSelect one:  \nIt is a First In  First Out (FIFO) list.  \n \nIDHTRE01  – One can convert a binary tree into its mirror image by traversing it in?  \nSelect one:  \nPost -order.  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \n(node -1)/2 \n \nIDESOA02  - Which statement below is wrong about comparison sorting algorithms?  \nSelect one:  \nThe time complexity of some comparison sorting algorithms can be faster than O(NlogN).  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linea r search ignores is the?  Select one:  \nOrder of the elements of the list.  \n \nIDHLI01  – Suppose that you want to sort a singly linked list, each list’s item is a large object. which of the \nfollowing sort algorithms should be used to minimum the time complexity?  \nSelect one:  \nInsertion sort.  \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHSQ06 – In the method F below, s is a stack containing integer items. What is the content of s after \ncalling F(), suppose that the top of the stack is the right most item?  \nSelect one:  \n3 5 9 2 4  \n \nIDETRE01  – A perfect binary tree with 2N+1 nodes contain?  \nSelect o ne: \nN interior nodes.  \n \nIDMGRA01  –The maximum degree of any vertex in a simple graph with N vertices is?  \nSelect one:  \nN-1 \n \nIDHTRE07 – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nE \n IDHTRE09 – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nU \n \nIDHSOA02  – Insertion sort is used to sort an array in the descending order. When does the best case \noccur?  \nSelect one:  \nThe array is already sorted in the descending order.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  \nSelect one:  \nX(data, prev, next)  \n \nIDESQ16 – What is the result of the following operation on the stack S: S.peek(S.push(X))?  \nSelect one:  \nX. \n \nIDMSQ05  – In method F below, the stack s contains character items. Which is the result if we call \nmethod F with the input string text=“datastructure”?  \nSelect one:  \nerutcurtsatad  \n \nIDESQAS11  – Complete the code below to sea rch for key in an array using linear seach algorithm?  \nSelect one:  \ni. \n \nIDETRE04  – Number of leaf nodes in a perfect binary tree of depth h is?  \nSelect one:  \n2^h.   \nIDMSOA11  – An array A contains integer items, each item has 03 digits. A={170,145,275,900,802}.  Radix \nsort algorithm is used to sort A. What is the content of A after the second sort pass?  \nSelect one:  \nA={900,802,145,170,275}  \n \nIDMAOA03  – What is the time complexity of the following algorithm with respect to the input size N  \nSelect one:  \nO(N)  \n \nIDETRE1 5 – Complete the following code of the method getParent() in the array -based tree \nimplementation?  \nSelect one:  \np[node]  \n \nIDESOA11  – Which statement is wrong about Quick sort algorithm?  \nSelect one:  \nA merge algorithm is needed to combine two partitioned arrays.  \n \nIDMSQ02  – A queue Q has 05 character items, Q={“A”, “B”, “C”, “D”, “E”} where “E” is the rear and “A” \nis the front of the queue. What is the content of Q if we perform the following list of operations on the \nqueue: enqueue(“F”) -->dequeue() -->dequeue() -->dequeque() -->enqueue(“D”)?  \nSelect one:  \nQ={“D”, “E” ,“F” ,“D”}  \n \nIDESQ14  – Suppose you enqueue 10, 20, 30, 40 onto a queue, then you dequeue three items. Which one \nis left on the queue?  \nSelect one:  \n40 \n IDESQ01  - Which statement below is wrong con cerning to stack data structure?  \nSelect one:  \nIt is a First In First Out (FIFO) list.  \n \nIDESQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function \nh(k)=(3k+4) mod 7. What is the address of the key k=10?  \nSelect one:  \n6. \n \nIDELI09 – Suppose that X is a node in the middle of the Singly Linked List. Complete the code below to \ndelete all nodes after X from the list?X.setNext( _____ );  \nSelect one:  \nnull.  \n \nIDELI05  – Which statement is correct about linked -list? \nSelect one:  \nElements of linked -list can be located dinamically and discontinuously.  \n \nIDEAOA14 – Suppose that the estimated time complexity of algorithm A and algorithm B is TA(N) and \nTB(N) respectively. How can we compare the time complexity of A and B?  \nSelect one:  \nWe compare the grow rate of the leading terms of TA(N) and TB(N).  \n \nIDESQAS15  – Which of the following statements is used in binary search algorithm to halve the array?  \nSelect one:  \nmiddle=(left + right)/2  \n \nIDMSQAS02  – Which is the prefix notation of the follo wing infix expression:5 + (7 + 9*3)*(2+8)?  \nSelect one:  \n+ 5 * + 7 * 9 3+ 2 8   \nIDESOA01  - Which statement below is wrong in the context of sorting algorithms?  \nSelect one:  \nThe sort key must be numeric.  \n \nIDEAOA08 – Which statement is wrong concerning to the be st-case time complexity of an algorithm?  \nSelect one:  \nThe best -case is used frequently to analyze the time complexity of algorithms.  \n \nIDHSQAS05  - The process of accessing stored in a serial access memory is similar to manipulating data \non a?  \nSelect one:  \nStack. \n \nIDMAOA03  – What is the time complexity of the following algorithm with respect to the input size N  \nSelect one:  \nO(N)  \n \nIDEGRA07  – Which is the best describe of the graph below?  \nSelect one:  \nUnweighted, undirected, complete graph.  \n \nIDETRE08 – What can you say about the following tree?  \nSelect one:  \nThis is an expression tree.  \n \nIDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweighted directed graph with vertex P as the source. In what order do th e nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?  \nSelect one:  P, Q, R, U, S, T  \n \nIDMSQAS08  – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresultant hash table?  \nSelect one:  \nB \n \nIDHLI05  – Method tailToFront() below moves the last node of a Singly Linked List into the front of the \nlist. Please complete the code of the method?  \nSelect one:  \nbeforeTail.setNext(null); tail.setNext(head); head=tail;  \n \nIDMSQ03  – A stack S has 05 character items, S={“5”, “4”, “3”, “2”, “1”} where “1” is the top of S. Which \noperations must be perform to change S into a new state: S={ “5”, “4”, “2”, “3”, “1”}?  \nSelect one:  \npop() -->pop() -->pop() -->push(“2”) -->push(“3”) -->push(“1”)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHAOA05 – What is the time complexity of the recursive method f(i) below?  \nSelect one:  \nO(N)  \n \nIDHSQ01  – Suppose that you are writing a program to evaluate if a given string input has proper closing \nparenthesis for every opening parenthesis. Which data structure should be used?  \nSelect one:  \nStack.   \nIDEGRA06  – If we use adjacency matrix for representing an unweighted graph, we will have?  \nSelect one:  \nA matrix contains only 0 and 1.  \n \nIDMSOA05  – A sorting algorithm is used to sort the array A={51,11,56,83,20,26,33} in ascending order. \nThe items of A in e ach sort pass are listed below. Which sorting algorithm is used?  \nSelect one:  \nSelection sort  \n \nIDHTRE03  – The pre -order traversal sequence of a binary search tree is: 30, 20, 10, 15, 25, 23, 39, 35, 42. \nWhich one of the following is the post -order traversal  sequence of the same tree?  \nSelect one:  \n15, 10, 23, 25, 20, 35, 42, 39, 30  \n \nIDELI11  – Complete the code below to insert a new node X at the POS position of a Singly Linked List?  \nSelect one:  \nY.getNext().  \n \nIDMSQAS11  – A characteristic of the data that binar y search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDHSQ06 – In the method F below, s is a stack containing integer items. What is the content of s after \ncalling F( ), suppose that the top of the stack is the right most item?  \nSelect one:  \n3 5 9 2 4  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  Select one:  \n(node -1)/2 \n \nIDESOA16  – Which of the following sorting algorithm does not have a worst case time complexity of \nO(n^2)?  \nSelect one:  \nMerge sort.  \n \nIDHTRE09  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nU \n \nIDHSOA07  – Consider an array A where the items are in the range from 1 to n^3. Which of the following \nsorting algorithms gives the best time efficiency when applied on A?  \nSelect one:  \nRadix sort  \n \nIDMSQ04  – A queue Q has 05 character items, Q={“5”, “4”, “3”, “2”, “1”} where “1” is the front and “5” \nis the rear of Q. Which operations must be perform to change Q into a new state: Q={“3”, “2”, “1”, “4”, \n“5”}?  \nSelect one:  \nenqueue(“4”) -->enqueue(“5”) -->dequeue() -->dequeue()  \n \nIDHAOA08 – The method f3(N) calls two methods f1(N ) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nSelect one:  \nO(N^4)  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method is used to?  \nSelect one:  add an item to the stack.  \n \nIDMLI05  – In an Array -based list, what does this code do to the list?  \nSelect one:  \nInsert an item to the list  \n \nIDETRE05  –How many nodes in a tree has no ancestors?  \nSelect one:  \n1. \n \nIDMGRA01  –The maximum degree of any vertex in a simple graph with N vertices is?  \nSelect one:  \nN-1 ", "text_chunks": ["1 HANOI UNIVERSITY Faculty of Information Technology    62FIT2DSA Data Structure and Algorithm Spring 2024 Module Description  Contact Details Instructor:    Dr. Nguyen Xuan Thang Office:    Room 212, Building C, Hanoi University Email:     nxthang@hanu.edu.vn   Module Overview  1. Module Details Faculty    Information Technology Module code    62FIT2DSA Module name  Data Structure and Algorithm Level     Undergraduate Number of credits   Three (3) Prerequisite    Programming 1 Suggested study   Five (05) hours per week Year    2024  2. Nature of the module It is a compulsory module for the second year students in the Excellent Educational Bachelor of IT Program (CLC Program). The goal of this module is to introduce the essential concepts and issues in Data structures and algorithms. Topics include algorithm analysis, searching/sorting algorithms and fundamental data structures such as stack, queue, tree and graph. The module aims to gear these ideas towards specific significant applications using Java programming language. 3. Learning objectives On the completion of this module students should be able to: 3.1. understand fundamental knowledge of algorithm design and analysis. 3.2. gain general knowledge about some types of data structures and their operations. 3.3. implement some basic algorithms such as sorting, searching or graph algorithms using Java programming language. 3.4. have teamwork, self-study and programming skills using Java. \n 2 3.5. develop self-motivation and time management skills.  Learning Resources Name Notes Use 1. Mark Allen Weiss, (2012), Data structures and algorithm analysis in Java, 3rd Edition, Pearson. Textbook Lecture 2. Thomas H, Cormen, et all (2009), Introduction to Algorithms, 3rd Edition, MIT Press Supplementary material  REF  Course website:   https://lms.fit.hanu.vn/course/view.php?id=10 Assessments 1. Assessment table is applied to all students Type Assessment Name Weight Brief Description Linked learning objectives Internal Attendance 10% Students are expected to attend all classes. Students must participate in at least 80% of classes. Students who are requesting an excused absence are expected to show certified evidences.  Discussion 20% Tasks will be assigned to students during class. Students have to present their answers or solutions.  3.3, 3.4, 3.5 Midterm 20% Paper-based exam  3.1, 3.2, 3.3 Final  50% Paper-based exam  3.1, 3.2, 3.3, 3.5  2. Determination of final grade Your internal marks and final mark are rounded to integers out of 10. Your course mark is rounded to one decimal place. The calculation for the course mark uses the weightings in the assessment table above. You are not qualified to take the final exam if you participate less than 80% of classes. Your grade is determined from your course mark according to Hanoi University scale:  3   Course mark Grade Pass the module  9.0 – 10 A+  8.5 – 8.9 A  8.0 – 8.4 B+  7.0 – 7.9 B  6.0 – 6.9 C+  5.5 – 5.9 C  5.0 – 5.4 D+ Fail the module  4.0 – 4.9 D  < 4.0 F   Teaching schedule  Week Lecture Tutorial Reading 1 Introduction  Java review [1] Chapter 1 [2] Subtopics 1.1 & 1.2 2 Analysis of algorithms Part I Algorithm implementation Part I [1] Chapter 2 [2] Subtopics 1.3 & 1.4 3 Analysis of algorithms Part II Algorithm implementation Part II [1] Chapter 2 [2] Subtopics 1.3 & 1.4 4 Sorting Part I Implement algorithms: selection sort, insertion sort, buble sort, merge sort [1] Chapter 7 [2] Subtopics 2.6 - 2.8 5 Sorting Part II Implement algorithms: quick sort, couting sort, radix sort [1] Chapter 7 [2] Subtopics 2.6 - 2.8 6 List Implement list operations [1] Chapter 3: 3.1 – 3.5 [2] Subtopic 3.10 7 Stack and Queue Implement stack and queue operations [1] Chapter 3: 3.6 & 3.7 [2] Subtopic 3.10 8 Midterm No tutorial  9 Stack and Queue application Implement stack and queue application [1] Chapter 3: 3.6 & 3.7 [2] Subtopic 3.10 10 Tree Part I Implement tree operations Part I [1] Chapter 4 [2] Subtopic 3.12 11 Tree Part II Implement tree operations Part II [1] Chapter 4 [2] Subtopic 3.12 12 Graph Part I Implement graph operations Part I [1] Chapter 9 [2] Subtopics 6.22 & 6.23 13 Graph Part II Implement graph operations Part II [1] Chapter 9 [2] Subtopics 6.22 & 6.23 14 Algorithm design techniques Self-study [1] Chapter 10 [2] Subtopics 4.15 & 4.16 15 Revision Q&A   4  Academic Honesty and Misconduct Hanoi University expects all students and staff to act with honesty and integrity with all matters. IDESOA12  – In Radix sort algorithm …?  \n A stable sorting algorithm is used to sort the digits.  \n  \n IDELI03  – In the ADT of the list data structure, isEmpty() method returns a/an _______ value?  \n Boolean.  \n  \n IDHTRE03 – The pre -order traversal sequence of a binary search tree is: 30, 20, 10, 15, 25, 23, 39, 35, \n42. Which one of the following is the post -order traversal sequence of the same tree?  \n 15, 10, 23, 25, 20, 35, 42, 39, 30  \n  \n The following method reverses the item's order of a stack using a queue. Ple ase complete the code of \nthe method?  \n    public static int reverse(SLLStack s)  \n    { \n           ArrayQueue q = new ArrayQueue();  \n           while (!s.isEmpty())  \n           { \n               StackNode node = Tr ả lời s.pop()  \n ;                    \n               q.enqueue(node.getData());  \n           } \n           while (Tr ả lời !q.isEmpty()  \n ) \n           { \n               StackNode newnode = new StackNode(q.dequeue());  \n               s.push(Tr ả lời newNode  \n ); \n           } \n    }   \nIDETRE07 – What can you say abou t the following tree?  \nThis is a binary search tree.  \n \nIDHSOA07  – Consider an array A where the items are in the range from 1 to n^3. Which of the following \nsorting algorithms gives the best time efficiency when applied on A?  \nRadix sort  \n \nIDMSOA08  – Which array represents a Min -Heap?  \nA={2,5,9,8,10,13,12,22,50}  \n \nIDHTRE10  – Suppose that we perform pre -order traversal of a binary tree T to get the sequence label \n“ABCDEXZUTY”. Then we perform in -order traversal of the same binary tree to get the sequen ce label \n“DCEBAUZTXY” as the result. What is the result if we perform post -order traversal of this tree?  \nDECBUTZYXA  \n \nIDMSQ10  – Suppose that you are implementing an operation named multiDequeue(int k) on a queue \ncontains integer items. This operation will p erform dequeue() k times and return the result of the kth \ndequeue(). Please complete the code of the operation?  \nm=m -1 \n \nIDMAOA15  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nO(N^2)  \n \nIDMSQAS01  – Which is the postfix notation of the following infix expression: ((8+2)*(5+7) -10)*9+3?  \n8 2 + 5 7 + * 10 - 9 * 3 +  \n \nIDMLI05  – In an Array -based list, what does this code do to the list?  \nInsert an item to the list  \n IDETRE20  – Compelete the following code of th e method inOrderTraversal() in the array -based binary \ntree implementation?  \nSystem.out.print(l[node]+“ ”)  \n \nIDEGRA08  – Which of the following is wrong about graph?  \nWeigh of an edge must be possitive.  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \n(node -1)/2 \n \nIDEGRA02  – The data structure required for Breadth First Traversal on a graph is?  \nQueue.  \n \nIDESQ07  – In ADT of the Queue data structure, enqueue() method will?  \nAdd a new item to the que ue at the rear position.  \n \nIDESQAS09  – Which of the following is not an application of the stack data structure?  \nMessage buffering.  \n \nIDMSQAS03  – Evaluate the following expression:8 7 + 6 4 + * 2 3 7 + * - 1 -? \n129 \n \nIDHAOA07  – The method f3(N) calls two meth ods f1(N) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nO(N^3)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nParallel edges.  IDMSQAS08 – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted i nto an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresultant hash table?  \nB \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nParallel edges.  \n \nIDESQ06  – In the ADT of the Queue data structure, dequeue() method will?  \nSelect one:  \nRemove an item from the queue at the front position.  \n \nIDETRE14  – In the ADT of array -based tree, P[K] indicates?  \nSelect one:  \nThe parent node of node K.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  \nSelect one:  \nX(data, prev, next)  \n \nIDESOA16 – Which of the following sorting algorithm does not have a worst case time complexity of \nO(n^2)?  \nMerge sort.  \n \nIDMGRA03  - In an unweighted, undirected  connected graph, the shortest path from a node S to every \nother node is computed most efficiently, in terms of time complexity by?  \nSelect one:  \nPerforming a BFS starting from S.  \n IDETRE17  – Which of the following is correct about array -based binary impleme ntation using perfect \nbinary tree indexing scheme?  \nSelect one:  \nThe left child and right child of node i are 2i+1 and 2i+2.  \n \nIDEGRA03  –   \nSelect one:  \nThe weight of the shortest path from vertex Vi to vertex Vj using intermediate verties in the set {V1..Vk}.  \n \nThe following method reverses the item's order of a stack using a queue. Please complete the code of \nthe method?  \n    public static int reverse(SLLStack s)  \n    { \n           ArrayQueue q = new ArrayQueue();  \n           while (!s.isEmpty())  \n           { \n               StackNode node = Tr ả lời s.pop()  \n ;                    \n               q.enqueue(node.getData());  \n           } \n           while (Tr ả lời !q.isEmpty()  \n ) \n           { \n               StackNode newnode = new StackNode(q.dequeue());  \n               s.push(Tr ả lời newnode  \n ); \n           } \n    } \n IDEGRA02  – The data structure required for Breadth First Traversal on a graph is?  \nSelect one:  \nQueue.", "binary tree indexing scheme?  \nSelect one:  \nThe left child and right child of node i are 2i+1 and 2i+2.  \n \nIDEGRA03  –   \nSelect one:  \nThe weight of the shortest path from vertex Vi to vertex Vj using intermediate verties in the set {V1..Vk}.  \n \nThe following method reverses the item's order of a stack using a queue. Please complete the code of \nthe method?  \n    public static int reverse(SLLStack s)  \n    { \n           ArrayQueue q = new ArrayQueue();  \n           while (!s.isEmpty())  \n           { \n               StackNode node = Tr ả lời s.pop()  \n ;                    \n               q.enqueue(node.getData());  \n           } \n           while (Tr ả lời !q.isEmpty()  \n ) \n           { \n               StackNode newnode = new StackNode(q.dequeue());  \n               s.push(Tr ả lời newnode  \n ); \n           } \n    } \n IDEGRA02  – The data structure required for Breadth First Traversal on a graph is?  \nSelect one:  \nQueue.  \n \nIDESQAS12  – In a hash table of the size N using linear probing, what is the probing hash function hi(k)?  \nSelect one:  \nhi(k)=(h(k)+i) mod N.  \n \nIDHTRE05  – A complete N -ary tree is a tree which each node has N children or no children. Let I be the \nnumber of interior nodes and L be the number of leaves in a complete N -aray  tree. If L=41 and I=10, \nwhat is the value of N?  \nSelect one:  \n5 \n \n \nIDESQ01  - Which statement below is wrong concerning to stack data structure?  \nSelect one:  \nIt is a First In First Out (FIFO) list.  \n \nIDMSQAS09  – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using open hashing with hash function: h(k)=k mod 10 and separate chaining. What is the \nresultant hash table?   \nSelect one:  \nA \n \nIDMAOA06  – Estimate the t ime complexity in Big -Oh notation, with respect to the input size N, for the \ncode below:   \nSelect one:  \nO(N^3)  \n IDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweighted directed graph with vertex P as the sou rce. In what order do the nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?   \nSelect one:  \nP, Q, R, U, S, T  \n \nIDHSOA04  – Which of the following sorting algorithms has the minimum number of swap o perations in \ngeneral?  \nSelect one:  \nInsertion sort  \n \nIDMSQAS03  – Evaluate the following expression:8 7 + 6 4 + * 2 3 7 + * - 1 -? \nSelect one:  \n129 \n \nIDHSQ05  – In the method F below, q is a queue containing integer items. What is the content of q after \ncalling F (), suppose that the rear of the queue is the right most item?   \nSelect one:  \n9 3 2 4 5  \n \nIDMSQ11  – Suppose that you are implementing an operation name multiPop(int k) on a stack contains \ninteger items. This operation will perform pop() k times and return th e result of the kth pop(). Please \ncomplete the code of the operation?   \nSelect one:  \nm=m -1 \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  Select one:  \nX(data, prev, next)  \n \nIDETRE03  – A binary tree that all its levels except possibly the last, is completely filled and all the node at \nthe last level appear as far left as possible,  is known as?  \nSelect one:  \nComplete binary tree.  \n \nIDHTRE07  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);   \nSelect one:  \nE \n \nIDESOA10  – In Merge sort algorithm …?  \nThe input array is d ivided into two parts at the middle of the array.  \n \nIDMSQAS08 – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresult ant hash table?   \nSelect one:  \nB \n \nIDEGRA06  – If we use adjacency matrix for representing an unweighted graph, we will have?  \nSelect one:  \nA matrix contains only 0 and 1  \n \nIDHAOA05 – What is the time complexity of the recursive method f(i) below?   \nSelect one:  \nO(N)  \n IDESQAS04  – What additional requirement is placed on an array, so that binary search may be used to \nsearch for a key?  \nSelect one:  \nThe array must be sorted.  \n \nIDHTRE09  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);   \nSelect one:  \nU \n \nIDMAOA09  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below   \nSelect one:  \nO(N^2)  \n \nIDETRE21  – Complete the following code of the method postOrderTrav ersal() in the array -based binary \ntree implementation?   \nSelect one:  \npostOrderTraversal(getRightChild(node))  \n \nIDEGRA09  – To implement Dijkstra’s shortest path algorithm on unweighted graphs the data structure \nto be used is?  \nSelect one:  \nQueue  \n \nIDHTRE10  – Suppose that we perform pre -order traversal of a binary tree T to get the sequence label \n“ABCDEXZUTY”. Then we perform in -order traversal of the same binary tree to get the sequence label \n“DCEBAUZTXY” as the result. What is the result if we perform post -orde r traversal of this tree?  \nSelect one:  \nDECBUTZYXA  \n IDMSQAS05  – Method F below takes a number n as an argument, and use a stack s to do processing. \nWhat does the method do in general?   \nSelect one:  \nPrint binary representation of n.  \n \nIDHSOA05  – Consider a modified version of Merge sort where the input array is partitioned at the \nposition one -third of the length N of the array. What is the recurrence of this algorithm?  \nSelect one:  \nT(N)=T(N/3)+T(2N/3)+O(N)  \n \nIDETRE05  –How many nodes in a tree has  no ancestors?  \nSelect one:  \n1 \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDETRE03  – A binary tree that all its levels except possibly the last, is completely filled and all the node at \nthe last level appear as far left as possible, is known as?  \nSelect one:  \nComplete binary tree.  \n \nIDMSQ12  – A queue q has 5 items. How many items left in q after executing: q.enqueue(q.dequeue())?  \nSelect one:  \n5 \n \nIDESOA16  – Which of the following sorting al gorithm does not have a worst case time complexity of \nO(n^2)?  \nSelect one:  Merge sort.  \n \nIDEGRA01  – In an undirected graph with N vertices and E edges, the sum of the degree of each vertex is \nequal to?  \nSelect one:  \n2E. \n \nIDHAOA08  – The method f3(N) calls two methods f1(N) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nSelect one:  \nO(N^4)  \n \nIDMLI09 - Consider method F in Java and a singly linked list L below. Suppose that H is the head node of \nthe list L. What is  the result if we call F(H)?  \nSelect one:  \n‘E’-->‘C’-->‘A’ \n \nIDMSQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function: \nh(k)=(3k+4) mod 7. Assuming the hash table is initially empty, which of the following is the contents  of \nthe table when the sequence 1, 3, 8, 10 is inserted into the table using close hasing with linear probing? \nNote that ‘ -’ denotes an empty location in the table.  \nSelect one:  \n1, 8, 10, -, -, -, 3 \n \nIDHTRE04 – The pre -order traversal sequence of a binary s earch tree is:70, 40, 20, 30, 60, 50, 90, 80, \n100. What is the depth of the binary search tree?  \nSelect one:  \n3 \n \nIDHSQ04 – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?  \nSelect one:  1 2 3 4 5 6 7 8 9 10  \n \nIDHLI04  – Method deleteTail() below is used to delete the last node in a Singly Linked List. Please \ncomplete the code of the method?  \nSelect one:  \nbeforeTail.setNext(null)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot cont ain information of?  \nSelect one:  \nParallel edges.  \n \nIDHTRE02  – The pre -order and post -order traversal of a binary tree generates the same output. The tree \ncan have maximum?  \nSelect one:  \nOne node.  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method  is used to?  \nSelect one:  \nadd an item to the stack.  \n \nIDEGRA04 – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDETRE16  – Complete the following code of the method getNodeLabel() in the array -based tree \nimplementation?   \nSelect one:  \nl[node]  \n IDHTRE06  – Consider the recursive, nested representation of binary trees: T=(O L R) indicates a binary \ntree T with the root node O, the left sub -tree L and the right sub -tree R. Note that L and R may be null or \nfurther nested. Which of the following represents a valid binary tree?  \nSelect one:  \n(1 (2 3 4) (5 6 7))  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDETRE 01 – A perfect binary tree with 2N+1 nodes contain?  \nSelect one:  \nN interior nodes.  \n \nIDHSOA03  – Given an array A that is almost sorted (only one or two elements are misplaced). Which \nsorting algorithm gives the best time efficiency when applied on A.  \nSelect one:  \nInsertion sort  \n \nIDMSQAS02  – Which is the prefix notation of the following infix expression:5 + (7 + 9*3)*(2+8)?  \nSelect one:  \n+ 5 * + 7 * 9 3+ 2 8  \n \nIDESQ10 – Complete the code for the dequeue() method in array -based circular queue?   \nSelect one:  \nfront=( front+1)%maxSize  \n \nIDESOA15  – What is an operation in which a list of elements is arranged either in ascending order or in \ndescending order?  \nSelect one:  Sorting.  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect  one:  \nParallel edges.  \n \nIDMLI04 – In a Singly Linked List implementation, what does this code to to the list?   \nSelect one:  \nRemove the node at the pos position from the list", "Select one:  \nN interior nodes.  \n \nIDHSOA03  – Given an array A that is almost sorted (only one or two elements are misplaced). Which \nsorting algorithm gives the best time efficiency when applied on A.  \nSelect one:  \nInsertion sort  \n \nIDMSQAS02  – Which is the prefix notation of the following infix expression:5 + (7 + 9*3)*(2+8)?  \nSelect one:  \n+ 5 * + 7 * 9 3+ 2 8  \n \nIDESQ10 – Complete the code for the dequeue() method in array -based circular queue?   \nSelect one:  \nfront=( front+1)%maxSize  \n \nIDESOA15  – What is an operation in which a list of elements is arranged either in ascending order or in \ndescending order?  \nSelect one:  Sorting.  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect  one:  \nParallel edges.  \n \nIDMLI04 – In a Singly Linked List implementation, what does this code to to the list?   \nSelect one:  \nRemove the node at the pos position from the list  \n \nIDESQAS05  – What is the best definition of a collision in a hash table?  \nSelect one : \nTwo entries with different keys have the same exact hash value.  \n \nIDEGRA05 – If we use adjacency matrix for representing a weighted undirected graph, we will have?  \nSelect one:  \nA symmetric matrix over its diagonal  \n \nIDHSQ04 – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?   \nSelect one:  \n1 2 3 4 5 6 7 8 9 10  \n \nIDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweigh ted directed graph with vertex P as the source. In what order do the nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?   \nSelect one:  \nP, Q, R, U, S, T  \n \nIDHTRE01  – One can convert a binary tree i nto its mirror image by traversing it in?  Post -order.  \n \nIDHLI04  – Method deleteTail() below is used to delete the last node in a Singly Linked List. Please \ncomplete the code of the method?   \nSelect one:  \nbeforeTail.setNext(null)  \n \nIDHSQ01  – Suppose that you a re writing a program to evaluate if a given string input has proper closing \nparenthesis for every opening parenthesis. Which data structure should be used?  \nStack.  \n \nIDMSQAS10  – Consider a hash table of size seven, with starting index zero, and a hash functi on: \nh(k)=(3k+4) mod 7. Assuming the hash table is initially empty, which of the following is the contents of \nthe table when the sequence 1, 3, 8, 10 is inserted into the table using close hasing with linear probing? \nNote that ‘ -’ denotes an empty location in the table.  \nSelect one:  \n1, 8, 10, -, -, -, 3 \n \nIDESQAS04  – What additional requirement is placed on an array, so that binary search may be used to \nsearch for a key?  \nThe array must be sorted.  \n \nIDETRE08  – What can you say about the following tree?   \nSelect one:  \nThis is an expression tree.  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nOrder of the elements of the list.  \n \nIDHSOA03  – Given an array A that is almost sorted (only one or two elements are misplac ed). Which \nsorting algorithm gives the best time efficiency when applied on A.  Select one:  \nInsertion sort  \n \nIDMSQ09  – In an array -based circular queue, which operation has time complexity O(N) in the worst -\ncase?  \nSelect one:  \nNo operation that has time comple xity O(N).  \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHTRE06  – Consider the recursive, nested representation of binary trees: T=(O L R) indicates a binary \ntree T with the root nod e O, the left sub -tree L and the right sub -tree R. Note that L and R may be null or \nfurther nested. Which of the following represents a valid binary tree?  \nSelect one:  \n(1 (2 3 4) (5 6 7))  \n \nIDMSOA12  – The Merge method in Merge sort algorithm is used to combi ne two sorted array \nA={3,27,38,43} and B={9,10,82}. What is the result array C?  \nSelect one:  \nC={3,9,10,27,38,43,82}  \n \nIDEGRA01  – In an undirected graph with N vertices and E edges, the sum of the degree of each vertex is \nequal to?  \nSelect one:  \n2E. \n \nIDETRE09  – Which of the following is wrong about a binary search tree?  \nSelect one:  The value of the left sub -tree is bigger than the value of the root.  \n \nIDMAOA13 – Consider three algorithms which have the time complexity in Big -Oh notation below. \nPlease arrange th ese algorithms in the ascending order of time efficiency (the slowest algorithm is the \nfirst one in the order).   \nSelect one:  \nAlgorithm 3, Algorithm 1, Algorithm 2  \n \nIDHAOA09  – What is O(T(N)), if   \nSelect one:  \nO(2^N)  \n \nIDMLI12  – What is the number of compar isons needed in the worst case to search for a given node in a \nSingly Linked List of the length N nodes?  \nSelect one:  \nN \n \nIDESOA04  – In a stable sort algorithm …?  \nSelect one:  \nThe relative order of elements with equal keys are maintained.  \n \nIDMGRA02  – An adjac ency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method is used to?  \nSelect one:  \nadd an item to the stack.  \n \nIDESQ04  – Which statement is correct about array -based stack?  Select one:  \ntop is the last item of the array.  \n \nIDMSQAS05 – Method F below takes a number n as an argument, and use a stack s to do processing. \nWhat does the method do in general?  \nSelect one:  \nPrint bi nary representation of n.  \n \nIDEGRA02 – The data structure required for Breadth First Traversal on a graph is?  \nSelect one:  \nQueue.  \n \nIDMAOA10  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nSelect one:  \nO(N^3)  \n \nIDMSQ11  – Suppose that you are implementing an operation name multiPop(int k) on a stack contains \ninteger items. This operation will perform pop() k times and return the result of the kth pop(). Please \ncomplete the code of the operation?  \nSelect one:  \nm=m -1 \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDETRE08  – What can you say about the following tree?  \nSelect one:  \nThis is an expression tree.   \nIDHLI02  – Method reverse() below is used to reverse the order of items in a Singly Linked List. Please \ncomplete the code of the method?  \nSelect one:  \nhead=prev  \n \nIDELI13 – In a Circular Linked List, if a Node X(data,next) is a tail which is the value of the X’s next?  \nSelect one:  \nhead  \n \nIDHSQ04  – In the method F below, q1 and q2 are two queues containing integer items. What should \nmethod F print on the screen?  \nSelect one:  \n1 2 3 4 5 6 7 8 9 10  \n \nIDMSOA02  – Insertion sort algorithm is used to sort the array A={23 ,78,45,8,32,56} in the ascending \norder. What are the items of A after 03 sort pass?  \nSelect one:  \nA={8,23,45,78,32,56}  \n \nIDESQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function \nh(k)=(3k+4) mod 7. What is the address of t he key k=10?  \nSelect one:  \n6. \n \nIDESOA12  – In Radix sort algorithm …?  \nSelect one:  \nA stable sorting algorithm is used to sort the digits.  \n IDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \nSelect o ne: \n(node -1)/2 \n \nIDHSOA02  – Insertion sort is used to sort an array in the descending order. When does the best case \noccur?  \nSelect one:  \nThe array is already sorted in the descending order.  \n \nIDMLI04  – In a Singly Linked List implementation, what does this code to to the list?  \nSelect one:  \nRemove the node at the pos position from the list  \n \nIDELI06 – In the ADT of the list data structure, remove(int post) method will?  \nRemove an item at the pos position  form the list.  \n \nIDHLI05  – Method tailToFront() below moves the last node of a Singly Linked List into the front of the \nlist. Please complete the code of the method?  \nbeforeTail.setNext(null); tail.setNext(head); head=tail;  \n \nIDEGRA04  – An adjacency matrix r epresentation of a graph cannot contain information of?  \nParallel edges.  \n \nIDEGRA09 – To implement Dijkstra’s shortest path algorithm on unweighted graphs the data structure \nto be used is?  \nQueue  \n \nIDHTRE02  – The pre -order and post -order traversal of a binary tree generates the same output. The tree \ncan have maximum?  One node.  \n \nIDMAOA09  – Estimate the time complexity in Big -Oh notation, with respect to the input size N for the \ncode below  \nO(N^2)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot c ontain information of?  \nParallel edges.  \n \nIDESQAS11  – Complete the code below to search for key in an array using linear seach algorithm?  \ni. \n \nIDESQ01 - Which statement below is wrong concerning to stack data structure?  \nSelect one:  \nIt is a First In  First Out (FIFO) list.  \n \nIDHTRE01  – One can convert a binary tree into its mirror image by traversing it in?  \nSelect one:  \nPost -order.  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \n(node -1)/2 \n \nIDESOA02  - Which statement below is wrong about comparison sorting algorithms?  \nSelect one:  \nThe time complexity of some comparison sorting algorithms can be faster than O(NlogN).  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linea r search ignores is the?  Select one:  \nOrder of the elements of the list.  \n \nIDHLI01  – Suppose that you want to sort a singly linked list, each list’s item is a large object. which of the \nfollowing sort algorithms should be used to minimum the time complexity?  \nSelect one:  \nInsertion sort.  \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.", "Select one:  \nIt is a First In  First Out (FIFO) list.  \n \nIDHTRE01  – One can convert a binary tree into its mirror image by traversing it in?  \nSelect one:  \nPost -order.  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  \n(node -1)/2 \n \nIDESOA02  - Which statement below is wrong about comparison sorting algorithms?  \nSelect one:  \nThe time complexity of some comparison sorting algorithms can be faster than O(NlogN).  \n \nIDMSQAS11  – A characteristic of the data that binary search uses but linea r search ignores is the?  Select one:  \nOrder of the elements of the list.  \n \nIDHLI01  – Suppose that you want to sort a singly linked list, each list’s item is a large object. which of the \nfollowing sort algorithms should be used to minimum the time complexity?  \nSelect one:  \nInsertion sort.  \n \nIDEGRA04  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHSQ06 – In the method F below, s is a stack containing integer items. What is the content of s after \ncalling F(), suppose that the top of the stack is the right most item?  \nSelect one:  \n3 5 9 2 4  \n \nIDETRE01  – A perfect binary tree with 2N+1 nodes contain?  \nSelect o ne: \nN interior nodes.  \n \nIDMGRA01  –The maximum degree of any vertex in a simple graph with N vertices is?  \nSelect one:  \nN-1 \n \nIDHTRE07 – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nE \n IDHTRE09 – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nU \n \nIDHSOA02  – Insertion sort is used to sort an array in the descending order. When does the best case \noccur?  \nSelect one:  \nThe array is already sorted in the descending order.  \n \nIDELI14  – Which is the common form of a node X in a Doubly Linked List?  \nSelect one:  \nX(data, prev, next)  \n \nIDESQ16 – What is the result of the following operation on the stack S: S.peek(S.push(X))?  \nSelect one:  \nX. \n \nIDMSQ05  – In method F below, the stack s contains character items. Which is the result if we call \nmethod F with the input string text=“datastructure”?  \nSelect one:  \nerutcurtsatad  \n \nIDESQAS11  – Complete the code below to sea rch for key in an array using linear seach algorithm?  \nSelect one:  \ni. \n \nIDETRE04  – Number of leaf nodes in a perfect binary tree of depth h is?  \nSelect one:  \n2^h.   \nIDMSOA11  – An array A contains integer items, each item has 03 digits. A={170,145,275,900,802}.  Radix \nsort algorithm is used to sort A. What is the content of A after the second sort pass?  \nSelect one:  \nA={900,802,145,170,275}  \n \nIDMAOA03  – What is the time complexity of the following algorithm with respect to the input size N  \nSelect one:  \nO(N)  \n \nIDETRE1 5 – Complete the following code of the method getParent() in the array -based tree \nimplementation?  \nSelect one:  \np[node]  \n \nIDESOA11  – Which statement is wrong about Quick sort algorithm?  \nSelect one:  \nA merge algorithm is needed to combine two partitioned arrays.  \n \nIDMSQ02  – A queue Q has 05 character items, Q={“A”, “B”, “C”, “D”, “E”} where “E” is the rear and “A” \nis the front of the queue. What is the content of Q if we perform the following list of operations on the \nqueue: enqueue(“F”) -->dequeue() -->dequeue() -->dequeque() -->enqueue(“D”)?  \nSelect one:  \nQ={“D”, “E” ,“F” ,“D”}  \n \nIDESQ14  – Suppose you enqueue 10, 20, 30, 40 onto a queue, then you dequeue three items. Which one \nis left on the queue?  \nSelect one:  \n40 \n IDESQ01  - Which statement below is wrong con cerning to stack data structure?  \nSelect one:  \nIt is a First In First Out (FIFO) list.  \n \nIDESQAS10  – Consider a hash table of size seven, with starting index zero, and a hash function \nh(k)=(3k+4) mod 7. What is the address of the key k=10?  \nSelect one:  \n6. \n \nIDELI09 – Suppose that X is a node in the middle of the Singly Linked List. Complete the code below to \ndelete all nodes after X from the list?X.setNext( _____ );  \nSelect one:  \nnull.  \n \nIDELI05  – Which statement is correct about linked -list? \nSelect one:  \nElements of linked -list can be located dinamically and discontinuously.  \n \nIDEAOA14 – Suppose that the estimated time complexity of algorithm A and algorithm B is TA(N) and \nTB(N) respectively. How can we compare the time complexity of A and B?  \nSelect one:  \nWe compare the grow rate of the leading terms of TA(N) and TB(N).  \n \nIDESQAS15  – Which of the following statements is used in binary search algorithm to halve the array?  \nSelect one:  \nmiddle=(left + right)/2  \n \nIDMSQAS02  – Which is the prefix notation of the follo wing infix expression:5 + (7 + 9*3)*(2+8)?  \nSelect one:  \n+ 5 * + 7 * 9 3+ 2 8   \nIDESOA01  - Which statement below is wrong in the context of sorting algorithms?  \nSelect one:  \nThe sort key must be numeric.  \n \nIDEAOA08 – Which statement is wrong concerning to the be st-case time complexity of an algorithm?  \nSelect one:  \nThe best -case is used frequently to analyze the time complexity of algorithms.  \n \nIDHSQAS05  - The process of accessing stored in a serial access memory is similar to manipulating data \non a?  \nSelect one:  \nStack. \n \nIDMAOA03  – What is the time complexity of the following algorithm with respect to the input size N  \nSelect one:  \nO(N)  \n \nIDEGRA07  – Which is the best describe of the graph below?  \nSelect one:  \nUnweighted, undirected, complete graph.  \n \nIDETRE08 – What can you say about the following tree?  \nSelect one:  \nThis is an expression tree.  \n \nIDMGRA04  – Suppose we run Dijkstra’s single source shortest -path algorithm on the following edge \nweighted directed graph with vertex P as the source. In what order do th e nodes get included into the \nset of vertices for which the shortest path distances are finalized (the cloud set)?  \nSelect one:  P, Q, R, U, S, T  \n \nIDMSQAS08  – The keys 12, 18, 13, 2, 3, 23, 15 and 5 are inserted into an initially empty hash table of \nlength 10 using close hashing with hash function: h(k)=k mod 10 and linear probing. What is the \nresultant hash table?  \nSelect one:  \nB \n \nIDHLI05  – Method tailToFront() below moves the last node of a Singly Linked List into the front of the \nlist. Please complete the code of the method?  \nSelect one:  \nbeforeTail.setNext(null); tail.setNext(head); head=tail;  \n \nIDMSQ03  – A stack S has 05 character items, S={“5”, “4”, “3”, “2”, “1”} where “1” is the top of S. Which \noperations must be perform to change S into a new state: S={ “5”, “4”, “2”, “3”, “1”}?  \nSelect one:  \npop() -->pop() -->pop() -->push(“2”) -->push(“3”) -->push(“1”)  \n \nIDMGRA02  – An adjacency matrix representation of a graph cannot contain information of?  \nSelect one:  \nParallel edges.  \n \nIDHAOA05 – What is the time complexity of the recursive method f(i) below?  \nSelect one:  \nO(N)  \n \nIDHSQ01  – Suppose that you are writing a program to evaluate if a given string input has proper closing \nparenthesis for every opening parenthesis. Which data structure should be used?  \nSelect one:  \nStack.   \nIDEGRA06  – If we use adjacency matrix for representing an unweighted graph, we will have?  \nSelect one:  \nA matrix contains only 0 and 1.  \n \nIDMSOA05  – A sorting algorithm is used to sort the array A={51,11,56,83,20,26,33} in ascending order. \nThe items of A in e ach sort pass are listed below. Which sorting algorithm is used?  \nSelect one:  \nSelection sort  \n \nIDHTRE03  – The pre -order traversal sequence of a binary search tree is: 30, 20, 10, 15, 25, 23, 39, 35, 42. \nWhich one of the following is the post -order traversal  sequence of the same tree?  \nSelect one:  \n15, 10, 23, 25, 20, 35, 42, 39, 30  \n \nIDELI11  – Complete the code below to insert a new node X at the POS position of a Singly Linked List?  \nSelect one:  \nY.getNext().  \n \nIDMSQAS11  – A characteristic of the data that binar y search uses but linear search ignores is the?  \nSelect one:  \nOrder of the elements of the list.  \n \nIDHSQ06 – In the method F below, s is a stack containing integer items. What is the content of s after \ncalling F( ), suppose that the top of the stack is the right most item?  \nSelect one:  \n3 5 9 2 4  \n \nIDETRE18  – Complete the following code of the method getParent() in the array -based binary tree \nimplementation?  Select one:  \n(node -1)/2 \n \nIDESOA16  – Which of the following sorting algorithm does not have a worst case time complexity of \nO(n^2)?  \nSelect one:  \nMerge sort.  \n \nIDHTRE09  – Given a binary tree T and a method print() as the following. What will be printed on the \nscreen, if we call: print(T,5);  \nSelect one:  \nU \n \nIDHSOA07  – Consider an array A where the items are in the range from 1 to n^3. Which of the following \nsorting algorithms gives the best time efficiency when applied on A?  \nSelect one:  \nRadix sort  \n \nIDMSQ04  – A queue Q has 05 character items, Q={“5”, “4”, “3”, “2”, “1”} where “1” is the front and “5” \nis the rear of Q. Which operations must be perform to change Q into a new state: Q={“3”, “2”, “1”, “4”, \n“5”}?  \nSelect one:  \nenqueue(“4”) -->enqueue(“5”) -->dequeue() -->dequeue()  \n \nIDHAOA08 – The method f3(N) calls two methods f1(N ) and f2(N) as follows. What is the time \ncomplexity of method f3(N)?  \nSelect one:  \nO(N^4)  \n \nIDESQ03  – In the ADT of the Stack data structure, push() method is used to?  \nSelect one:  add an item to the stack.  \n \nIDMLI05  – In an Array -based list, what does this code do to the list?  \nSelect one:  \nInsert an item to the list  \n \nIDETRE05  –How many nodes in a tree has no ancestors?  \nSelect one:  \n1. \n \nIDMGRA01  –The maximum degree of any vertex in a simple graph with N vertices is?  \nSelect one:  \nN-1"]}